{"keras_version": "2.1.5-tf", "class_name": "Sequential", "config": [{"class_name": "Model", "config": {"output_layers": [["block5_pool", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 224, 224, 3], "name": "input_1", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block1_conv1", "config": {"bias_constraint": null, "trainable": false, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "name": "block1_conv1", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null, "filters": 64, "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0}}, "use_bias": true}}, {"inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block1_conv2", "config": {"bias_constraint": null, "trainable": false, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "name": "block1_conv2", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null, "filters": 64, "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0}}, "use_bias": true}}, {"inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block1_pool", "config": {"trainable": false, "padding": "valid", "data_format": "channels_last", "dtype": "float32", "strides": [2, 2], "pool_size": [2, 2], "name": "block1_pool"}}, {"inbound_nodes": [[["block1_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "block2_conv1", "config": {"bias_constraint": null, "trainable": false, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "name": "block2_conv1", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null, "filters": 128, "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0}}, "use_bias": true}}, {"inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block2_conv2", "config": {"bias_constraint": null, "trainable": false, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "name": "block2_conv2", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null, "filters": 128, "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0}}, "use_bias": true}}, {"inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block2_pool", "config": {"trainable": false, "padding": "valid", "data_format": "channels_last", "dtype": "float32", "strides": [2, 2], "pool_size": [2, 2], "name": "block2_pool"}}, {"inbound_nodes": [[["block2_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv1", "config": {"bias_constraint": null, "trainable": false, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "name": "block3_conv1", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null, "filters": 256, "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0}}, "use_bias": true}}, {"inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv2", "config": {"bias_constraint": null, "trainable": false, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "name": "block3_conv2", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null, "filters": 256, "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0}}, "use_bias": true}}, {"inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv3", "config": {"bias_constraint": null, "trainable": false, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "name": "block3_conv3", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null, "filters": 256, "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0}}, "use_bias": true}}, {"inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv4", "config": {"bias_constraint": null, "trainable": false, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "name": "block3_conv4", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null, "filters": 256, "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0}}, "use_bias": true}}, {"inbound_nodes": [[["block3_conv4", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block3_pool", "config": {"trainable": false, "padding": "valid", "data_format": "channels_last", "dtype": "float32", "strides": [2, 2], "pool_size": [2, 2], "name": "block3_pool"}}, {"inbound_nodes": [[["block3_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv1", "config": {"bias_constraint": null, "trainable": false, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "name": "block4_conv1", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null, "filters": 512, "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0}}, "use_bias": true}}, {"inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv2", "config": {"bias_constraint": null, "trainable": false, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "name": "block4_conv2", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null, "filters": 512, "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0}}, "use_bias": true}}, {"inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv3", "config": {"bias_constraint": null, "trainable": false, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "name": "block4_conv3", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null, "filters": 512, "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0}}, "use_bias": true}}, {"inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv4", "config": {"bias_constraint": null, "trainable": false, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "name": "block4_conv4", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null, "filters": 512, "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0}}, "use_bias": true}}, {"inbound_nodes": [[["block4_conv4", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block4_pool", "config": {"trainable": false, "padding": "valid", "data_format": "channels_last", "dtype": "float32", "strides": [2, 2], "pool_size": [2, 2], "name": "block4_pool"}}, {"inbound_nodes": [[["block4_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv1", "config": {"bias_constraint": null, "trainable": false, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "name": "block5_conv1", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null, "filters": 512, "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0}}, "use_bias": true}}, {"inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv2", "config": {"bias_constraint": null, "trainable": false, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "name": "block5_conv2", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null, "filters": 512, "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0}}, "use_bias": true}}, {"inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv3", "config": {"bias_constraint": null, "trainable": false, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "name": "block5_conv3", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null, "filters": 512, "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0}}, "use_bias": true}}, {"inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv4", "config": {"bias_constraint": null, "trainable": false, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "name": "block5_conv4", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null, "filters": 512, "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0}}, "use_bias": true}}, {"inbound_nodes": [[["block5_conv4", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block5_pool", "config": {"trainable": false, "padding": "valid", "data_format": "channels_last", "dtype": "float32", "strides": [2, 2], "pool_size": [2, 2], "name": "block5_pool"}}], "name": "model_1", "input_layers": [["input_1", 0, 0]]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "dtype": "float32"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "name": "dense_1", "activation": "relu", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "activity_regularizer": null, "units": 1024, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0}}}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "noise_shape": null, "rate": 0.5, "dtype": "float32", "name": "dropout_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "name": "dense_2", "activation": "relu", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "activity_regularizer": null, "units": 1024, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0}}}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "noise_shape": null, "rate": 0.5, "dtype": "float32", "name": "dropout_2"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "name": "dense_3", "activation": "sigmoid", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "activity_regularizer": null, "units": 28, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0}}}}], "backend": "tensorflow"}