{"backend": "tensorflow", "config": [{"config": {"name": "model_1", "output_layers": [["block5_pool", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 224, 224, 3], "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "block1_conv1", "config": {"filters": 64, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "trainable": false, "name": "block1_conv1", "activity_regularizer": null, "activation": "relu", "dtype": "float32", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block1_conv2", "config": {"filters": 64, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "trainable": false, "name": "block1_conv2", "activity_regularizer": null, "activation": "relu", "dtype": "float32", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block1_pool", "config": {"padding": "valid", "data_format": "channels_last", "dtype": "float32", "strides": [2, 2], "trainable": false, "name": "block1_pool", "pool_size": [2, 2]}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "block2_conv1", "config": {"filters": 128, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "trainable": false, "name": "block2_conv1", "activity_regularizer": null, "activation": "relu", "dtype": "float32", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block2_conv2", "config": {"filters": 128, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "trainable": false, "name": "block2_conv2", "activity_regularizer": null, "activation": "relu", "dtype": "float32", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block2_pool", "config": {"padding": "valid", "data_format": "channels_last", "dtype": "float32", "strides": [2, 2], "trainable": false, "name": "block2_pool", "pool_size": [2, 2]}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "block3_conv1", "config": {"filters": 256, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "trainable": false, "name": "block3_conv1", "activity_regularizer": null, "activation": "relu", "dtype": "float32", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block3_conv2", "config": {"filters": 256, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "trainable": false, "name": "block3_conv2", "activity_regularizer": null, "activation": "relu", "dtype": "float32", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block3_conv3", "config": {"filters": 256, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "trainable": false, "name": "block3_conv3", "activity_regularizer": null, "activation": "relu", "dtype": "float32", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block3_conv4", "config": {"filters": 256, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "trainable": false, "name": "block3_conv4", "activity_regularizer": null, "activation": "relu", "dtype": "float32", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block3_pool", "config": {"padding": "valid", "data_format": "channels_last", "dtype": "float32", "strides": [2, 2], "trainable": false, "name": "block3_pool", "pool_size": [2, 2]}, "inbound_nodes": [[["block3_conv4", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "block4_conv1", "config": {"filters": 512, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "trainable": false, "name": "block4_conv1", "activity_regularizer": null, "activation": "relu", "dtype": "float32", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block4_conv2", "config": {"filters": 512, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "trainable": false, "name": "block4_conv2", "activity_regularizer": null, "activation": "relu", "dtype": "float32", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block4_conv3", "config": {"filters": 512, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "trainable": false, "name": "block4_conv3", "activity_regularizer": null, "activation": "relu", "dtype": "float32", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block4_conv4", "config": {"filters": 512, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "trainable": false, "name": "block4_conv4", "activity_regularizer": null, "activation": "relu", "dtype": "float32", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block4_pool", "config": {"padding": "valid", "data_format": "channels_last", "dtype": "float32", "strides": [2, 2], "trainable": false, "name": "block4_pool", "pool_size": [2, 2]}, "inbound_nodes": [[["block4_conv4", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "block5_conv1", "config": {"filters": 512, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "trainable": false, "name": "block5_conv1", "activity_regularizer": null, "activation": "relu", "dtype": "float32", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block5_conv2", "config": {"filters": 512, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "trainable": false, "name": "block5_conv2", "activity_regularizer": null, "activation": "relu", "dtype": "float32", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block5_conv3", "config": {"filters": 512, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "trainable": false, "name": "block5_conv3", "activity_regularizer": null, "activation": "relu", "dtype": "float32", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block5_conv4", "config": {"filters": 512, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "trainable": false, "name": "block5_conv4", "activity_regularizer": null, "activation": "relu", "dtype": "float32", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block5_pool", "config": {"padding": "valid", "data_format": "channels_last", "dtype": "float32", "strides": [2, 2], "trainable": false, "name": "block5_pool", "pool_size": [2, 2]}, "inbound_nodes": [[["block5_conv4", 0, 0, {}]]], "class_name": "MaxPooling2D"}]}, "class_name": "Model"}, {"config": {"trainable": true, "name": "flatten_2", "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"units": 4096, "kernel_regularizer": null, "use_bias": true, "name": "dense_4", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "activation": "relu", "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"seed": null, "dtype": "float32", "trainable": true, "name": "dropout_3", "noise_shape": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"units": 4096, "kernel_regularizer": null, "use_bias": true, "name": "dense_5", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "activation": "relu", "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"seed": null, "dtype": "float32", "trainable": true, "name": "dropout_4", "noise_shape": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"units": 25, "kernel_regularizer": null, "use_bias": true, "name": "dense_6", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.5-tf"}