{"keras_version": "2.1.5-tf", "config": [{"class_name": "Model", "config": {"name": "model_2", "input_layers": [["input_2", 0, 0]], "output_layers": [["block5_pool", 0, 0]], "layers": [{"name": "input_2", "config": {"sparse": false, "name": "input_2", "dtype": "float32", "batch_input_shape": [null, 224, 224, 3]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "block1_conv1", "config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": false, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "block1_conv1", "activation": "relu", "padding": "same", "strides": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "block1_conv2", "config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": false, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "block1_conv2", "activation": "relu", "padding": "same", "strides": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"name": "block1_pool", "config": {"pool_size": [2, 2], "trainable": false, "name": "block1_pool", "data_format": "channels_last", "padding": "valid", "dtype": "float32", "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"name": "block2_conv1", "config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 128, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": false, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "block2_conv1", "activation": "relu", "padding": "same", "strides": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"name": "block2_conv2", "config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 128, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": false, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "block2_conv2", "activation": "relu", "padding": "same", "strides": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"name": "block2_pool", "config": {"pool_size": [2, 2], "trainable": false, "name": "block2_pool", "data_format": "channels_last", "padding": "valid", "dtype": "float32", "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"name": "block3_conv1", "config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 256, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": false, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "block3_conv1", "activation": "relu", "padding": "same", "strides": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"name": "block3_conv2", "config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 256, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": false, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "block3_conv2", "activation": "relu", "padding": "same", "strides": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"name": "block3_conv3", "config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 256, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": false, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "block3_conv3", "activation": "relu", "padding": "same", "strides": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"name": "block3_conv4", "config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 256, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": false, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "block3_conv4", "activation": "relu", "padding": "same", "strides": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"name": "block3_pool", "config": {"pool_size": [2, 2], "trainable": false, "name": "block3_pool", "data_format": "channels_last", "padding": "valid", "dtype": "float32", "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv4", 0, 0, {}]]]}, {"name": "block4_conv1", "config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 512, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": false, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "block4_conv1", "activation": "relu", "padding": "same", "strides": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"name": "block4_conv2", "config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 512, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": false, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "block4_conv2", "activation": "relu", "padding": "same", "strides": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"name": "block4_conv3", "config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 512, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": false, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "block4_conv3", "activation": "relu", "padding": "same", "strides": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"name": "block4_conv4", "config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 512, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": false, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "block4_conv4", "activation": "relu", "padding": "same", "strides": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"name": "block4_pool", "config": {"pool_size": [2, 2], "trainable": false, "name": "block4_pool", "data_format": "channels_last", "padding": "valid", "dtype": "float32", "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv4", 0, 0, {}]]]}, {"name": "block5_conv1", "config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 512, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": false, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "block5_conv1", "activation": "relu", "padding": "same", "strides": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"name": "block5_conv2", "config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 512, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": false, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "block5_conv2", "activation": "relu", "padding": "same", "strides": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"name": "block5_conv3", "config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 512, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": false, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "block5_conv3", "activation": "relu", "padding": "same", "strides": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"name": "block5_conv4", "config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 512, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": false, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "block5_conv4", "activation": "relu", "padding": "same", "strides": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"name": "block5_pool", "config": {"pool_size": [2, 2], "trainable": false, "name": "block5_pool", "data_format": "channels_last", "padding": "valid", "dtype": "float32", "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv4", 0, 0, {}]]]}]}}, {"class_name": "Flatten", "config": {"name": "flatten_6", "trainable": true, "dtype": "float32"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null, "scale": 1.0}}, "units": 1024, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "name": "dense_16", "activation": "relu"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "name": "dropout_11", "trainable": true, "dtype": "float32", "seed": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null, "scale": 1.0}}, "units": 1024, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "name": "dense_17", "activation": "relu"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "name": "dropout_12", "trainable": true, "dtype": "float32", "seed": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null, "scale": 1.0}}, "units": 25, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "name": "dense_18", "activation": "sigmoid"}}], "class_name": "Sequential", "backend": "tensorflow"}