{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.1.5-tf", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_6", "config": {"batch_input_shape": [null, 224, 224, 3], "sparse": false, "name": "input_6", "dtype": "float32"}}, {"inbound_nodes": [[["input_6", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv1", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [7, 7], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 64, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [2, 2], "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "conv1"}}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn_conv1", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn_conv1", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn_conv1", 0, 0, {}]]], "class_name": "Activation", "name": "activation_197", "config": {"activation": "relu", "trainable": false, "name": "activation_197", "dtype": "float32"}}, {"inbound_nodes": [[["activation_197", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_5", "config": {"pool_size": [3, 3], "name": "max_pooling2d_5", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": false, "dtype": "float32"}}, {"inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "res2a_branch2a", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 64, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res2a_branch2a"}}, {"inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn2a_branch2a", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn2a_branch2a", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]], "class_name": "Activation", "name": "activation_198", "config": {"activation": "relu", "trainable": false, "name": "activation_198", "dtype": "float32"}}, {"inbound_nodes": [[["activation_198", 0, 0, {}]]], "class_name": "Conv2D", "name": "res2a_branch2b", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 64, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res2a_branch2b"}}, {"inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn2a_branch2b", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn2a_branch2b", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]], "class_name": "Activation", "name": "activation_199", "config": {"activation": "relu", "trainable": false, "name": "activation_199", "dtype": "float32"}}, {"inbound_nodes": [[["activation_199", 0, 0, {}]]], "class_name": "Conv2D", "name": "res2a_branch2c", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 256, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res2a_branch2c"}}, {"inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "res2a_branch1", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 256, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res2a_branch1"}}, {"inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn2a_branch2c", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn2a_branch2c", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["res2a_branch1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn2a_branch1", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn2a_branch1", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]], "class_name": "Add", "name": "add_65", "config": {"name": "add_65", "trainable": false, "dtype": "float32"}}, {"inbound_nodes": [[["add_65", 0, 0, {}]]], "class_name": "Activation", "name": "activation_200", "config": {"activation": "relu", "trainable": false, "name": "activation_200", "dtype": "float32"}}, {"inbound_nodes": [[["activation_200", 0, 0, {}]]], "class_name": "Conv2D", "name": "res2b_branch2a", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 64, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res2b_branch2a"}}, {"inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn2b_branch2a", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn2b_branch2a", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]], "class_name": "Activation", "name": "activation_201", "config": {"activation": "relu", "trainable": false, "name": "activation_201", "dtype": "float32"}}, {"inbound_nodes": [[["activation_201", 0, 0, {}]]], "class_name": "Conv2D", "name": "res2b_branch2b", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 64, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res2b_branch2b"}}, {"inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn2b_branch2b", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn2b_branch2b", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]], "class_name": "Activation", "name": "activation_202", "config": {"activation": "relu", "trainable": false, "name": "activation_202", "dtype": "float32"}}, {"inbound_nodes": [[["activation_202", 0, 0, {}]]], "class_name": "Conv2D", "name": "res2b_branch2c", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 256, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res2b_branch2c"}}, {"inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn2b_branch2c", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn2b_branch2c", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_200", 0, 0, {}]]], "class_name": "Add", "name": "add_66", "config": {"name": "add_66", "trainable": false, "dtype": "float32"}}, {"inbound_nodes": [[["add_66", 0, 0, {}]]], "class_name": "Activation", "name": "activation_203", "config": {"activation": "relu", "trainable": false, "name": "activation_203", "dtype": "float32"}}, {"inbound_nodes": [[["activation_203", 0, 0, {}]]], "class_name": "Conv2D", "name": "res2c_branch2a", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 64, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res2c_branch2a"}}, {"inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn2c_branch2a", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn2c_branch2a", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]], "class_name": "Activation", "name": "activation_204", "config": {"activation": "relu", "trainable": false, "name": "activation_204", "dtype": "float32"}}, {"inbound_nodes": [[["activation_204", 0, 0, {}]]], "class_name": "Conv2D", "name": "res2c_branch2b", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 64, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res2c_branch2b"}}, {"inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn2c_branch2b", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn2c_branch2b", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]], "class_name": "Activation", "name": "activation_205", "config": {"activation": "relu", "trainable": false, "name": "activation_205", "dtype": "float32"}}, {"inbound_nodes": [[["activation_205", 0, 0, {}]]], "class_name": "Conv2D", "name": "res2c_branch2c", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 256, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res2c_branch2c"}}, {"inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn2c_branch2c", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn2c_branch2c", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_203", 0, 0, {}]]], "class_name": "Add", "name": "add_67", "config": {"name": "add_67", "trainable": false, "dtype": "float32"}}, {"inbound_nodes": [[["add_67", 0, 0, {}]]], "class_name": "Activation", "name": "activation_206", "config": {"activation": "relu", "trainable": false, "name": "activation_206", "dtype": "float32"}}, {"inbound_nodes": [[["activation_206", 0, 0, {}]]], "class_name": "Conv2D", "name": "res3a_branch2a", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 128, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [2, 2], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res3a_branch2a"}}, {"inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn3a_branch2a", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn3a_branch2a", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]], "class_name": "Activation", "name": "activation_207", "config": {"activation": "relu", "trainable": false, "name": "activation_207", "dtype": "float32"}}, {"inbound_nodes": [[["activation_207", 0, 0, {}]]], "class_name": "Conv2D", "name": "res3a_branch2b", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 128, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res3a_branch2b"}}, {"inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn3a_branch2b", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn3a_branch2b", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]], "class_name": "Activation", "name": "activation_208", "config": {"activation": "relu", "trainable": false, "name": "activation_208", "dtype": "float32"}}, {"inbound_nodes": [[["activation_208", 0, 0, {}]]], "class_name": "Conv2D", "name": "res3a_branch2c", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 512, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res3a_branch2c"}}, {"inbound_nodes": [[["activation_206", 0, 0, {}]]], "class_name": "Conv2D", "name": "res3a_branch1", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 512, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [2, 2], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res3a_branch1"}}, {"inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn3a_branch2c", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn3a_branch2c", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["res3a_branch1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn3a_branch1", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn3a_branch1", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]], "class_name": "Add", "name": "add_68", "config": {"name": "add_68", "trainable": false, "dtype": "float32"}}, {"inbound_nodes": [[["add_68", 0, 0, {}]]], "class_name": "Activation", "name": "activation_209", "config": {"activation": "relu", "trainable": false, "name": "activation_209", "dtype": "float32"}}, {"inbound_nodes": [[["activation_209", 0, 0, {}]]], "class_name": "Conv2D", "name": "res3b_branch2a", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 128, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res3b_branch2a"}}, {"inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn3b_branch2a", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn3b_branch2a", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]], "class_name": "Activation", "name": "activation_210", "config": {"activation": "relu", "trainable": false, "name": "activation_210", "dtype": "float32"}}, {"inbound_nodes": [[["activation_210", 0, 0, {}]]], "class_name": "Conv2D", "name": "res3b_branch2b", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 128, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res3b_branch2b"}}, {"inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn3b_branch2b", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn3b_branch2b", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]], "class_name": "Activation", "name": "activation_211", "config": {"activation": "relu", "trainable": false, "name": "activation_211", "dtype": "float32"}}, {"inbound_nodes": [[["activation_211", 0, 0, {}]]], "class_name": "Conv2D", "name": "res3b_branch2c", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 512, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res3b_branch2c"}}, {"inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn3b_branch2c", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn3b_branch2c", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_209", 0, 0, {}]]], "class_name": "Add", "name": "add_69", "config": {"name": "add_69", "trainable": false, "dtype": "float32"}}, {"inbound_nodes": [[["add_69", 0, 0, {}]]], "class_name": "Activation", "name": "activation_212", "config": {"activation": "relu", "trainable": false, "name": "activation_212", "dtype": "float32"}}, {"inbound_nodes": [[["activation_212", 0, 0, {}]]], "class_name": "Conv2D", "name": "res3c_branch2a", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 128, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res3c_branch2a"}}, {"inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn3c_branch2a", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn3c_branch2a", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]], "class_name": "Activation", "name": "activation_213", "config": {"activation": "relu", "trainable": false, "name": "activation_213", "dtype": "float32"}}, {"inbound_nodes": [[["activation_213", 0, 0, {}]]], "class_name": "Conv2D", "name": "res3c_branch2b", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 128, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res3c_branch2b"}}, {"inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn3c_branch2b", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn3c_branch2b", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]], "class_name": "Activation", "name": "activation_214", "config": {"activation": "relu", "trainable": false, "name": "activation_214", "dtype": "float32"}}, {"inbound_nodes": [[["activation_214", 0, 0, {}]]], "class_name": "Conv2D", "name": "res3c_branch2c", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 512, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res3c_branch2c"}}, {"inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn3c_branch2c", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn3c_branch2c", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_212", 0, 0, {}]]], "class_name": "Add", "name": "add_70", "config": {"name": "add_70", "trainable": false, "dtype": "float32"}}, {"inbound_nodes": [[["add_70", 0, 0, {}]]], "class_name": "Activation", "name": "activation_215", "config": {"activation": "relu", "trainable": false, "name": "activation_215", "dtype": "float32"}}, {"inbound_nodes": [[["activation_215", 0, 0, {}]]], "class_name": "Conv2D", "name": "res3d_branch2a", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 128, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res3d_branch2a"}}, {"inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn3d_branch2a", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn3d_branch2a", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]], "class_name": "Activation", "name": "activation_216", "config": {"activation": "relu", "trainable": false, "name": "activation_216", "dtype": "float32"}}, {"inbound_nodes": [[["activation_216", 0, 0, {}]]], "class_name": "Conv2D", "name": "res3d_branch2b", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 128, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res3d_branch2b"}}, {"inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn3d_branch2b", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn3d_branch2b", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]], "class_name": "Activation", "name": "activation_217", "config": {"activation": "relu", "trainable": false, "name": "activation_217", "dtype": "float32"}}, {"inbound_nodes": [[["activation_217", 0, 0, {}]]], "class_name": "Conv2D", "name": "res3d_branch2c", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 512, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res3d_branch2c"}}, {"inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn3d_branch2c", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn3d_branch2c", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_215", 0, 0, {}]]], "class_name": "Add", "name": "add_71", "config": {"name": "add_71", "trainable": false, "dtype": "float32"}}, {"inbound_nodes": [[["add_71", 0, 0, {}]]], "class_name": "Activation", "name": "activation_218", "config": {"activation": "relu", "trainable": false, "name": "activation_218", "dtype": "float32"}}, {"inbound_nodes": [[["activation_218", 0, 0, {}]]], "class_name": "Conv2D", "name": "res4a_branch2a", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 256, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [2, 2], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res4a_branch2a"}}, {"inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn4a_branch2a", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn4a_branch2a", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]], "class_name": "Activation", "name": "activation_219", "config": {"activation": "relu", "trainable": false, "name": "activation_219", "dtype": "float32"}}, {"inbound_nodes": [[["activation_219", 0, 0, {}]]], "class_name": "Conv2D", "name": "res4a_branch2b", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 256, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res4a_branch2b"}}, {"inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn4a_branch2b", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn4a_branch2b", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]], "class_name": "Activation", "name": "activation_220", "config": {"activation": "relu", "trainable": false, "name": "activation_220", "dtype": "float32"}}, {"inbound_nodes": [[["activation_220", 0, 0, {}]]], "class_name": "Conv2D", "name": "res4a_branch2c", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 1024, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res4a_branch2c"}}, {"inbound_nodes": [[["activation_218", 0, 0, {}]]], "class_name": "Conv2D", "name": "res4a_branch1", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 1024, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [2, 2], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res4a_branch1"}}, {"inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn4a_branch2c", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn4a_branch2c", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["res4a_branch1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn4a_branch1", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn4a_branch1", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]], "class_name": "Add", "name": "add_72", "config": {"name": "add_72", "trainable": false, "dtype": "float32"}}, {"inbound_nodes": [[["add_72", 0, 0, {}]]], "class_name": "Activation", "name": "activation_221", "config": {"activation": "relu", "trainable": false, "name": "activation_221", "dtype": "float32"}}, {"inbound_nodes": [[["activation_221", 0, 0, {}]]], "class_name": "Conv2D", "name": "res4b_branch2a", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 256, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res4b_branch2a"}}, {"inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn4b_branch2a", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "dtype": "float32", "name": "bn4b_branch2a", "scale": true, "epsilon": 0.001, "axis": [3], "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]], "class_name": "Activation", "name": "activation_222", "config": {"activation": "relu", "trainable": false, "name": "activation_222", "dtype": "float32"}}, {"inbound_nodes": [[["activation_222", 0, 0, {}]]], "class_name": "Conv2D", "name": "res4b_branch2b", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": false, "dtype": "float32", "filters": 256, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "name": "res4b_branch2b"}}, {"inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn4b_branch2b", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, 