{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 224, 224, 3], "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "filters": 64, "kernel_size": [7, 7], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "conv1", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [2, 2], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn_conv1", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "bn_conv1"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_1", "activation": "relu"}, "inbound_nodes": [[["bn_conv1", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "MaxPooling2D", "config": {"trainable": false, "dtype": "float32", "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [3, 3]}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "filters": 64, "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res2a_branch2a", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "res2a_branch2a"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn2a_branch2a", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]], "name": "bn2a_branch2a"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_2", "activation": "relu"}, "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]], "name": "activation_2"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "filters": 64, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res2a_branch2b", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "res2a_branch2b"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn2a_branch2b", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]], "name": "bn2a_branch2b"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_3", "activation": "relu"}, "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]], "name": "activation_3"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "filters": 256, "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res2a_branch2c", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "res2a_branch2c"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "filters": 256, "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res2a_branch1", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "res2a_branch1"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn2a_branch2c", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]], "name": "bn2a_branch2c"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn2a_branch1", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]], "name": "bn2a_branch1"}, {"class_name": "Add", "config": {"trainable": false, "dtype": "float32", "name": "add_1"}, "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]], "name": "add_1"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_4", "activation": "relu"}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "activation_4"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "filters": 64, "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res2b_branch2a", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "res2b_branch2a"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn2b_branch2a", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]], "name": "bn2b_branch2a"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_5", "activation": "relu"}, "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]], "name": "activation_5"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "filters": 64, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res2b_branch2b", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "res2b_branch2b"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn2b_branch2b", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]], "name": "bn2b_branch2b"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_6", "activation": "relu"}, "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]], "name": "activation_6"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "filters": 256, "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res2b_branch2c", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "res2b_branch2c"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn2b_branch2c", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]], "name": "bn2b_branch2c"}, {"class_name": "Add", "config": {"trainable": false, "dtype": "float32", "name": "add_2"}, "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_4", 0, 0, {}]]], "name": "add_2"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_7", "activation": "relu"}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "activation_7"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "filters": 64, "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res2c_branch2a", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "res2c_branch2a"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn2c_branch2a", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]], "name": "bn2c_branch2a"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_8", "activation": "relu"}, "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]], "name": "activation_8"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "filters": 64, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res2c_branch2b", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "res2c_branch2b"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn2c_branch2b", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]], "name": "bn2c_branch2b"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_9", "activation": "relu"}, "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]], "name": "activation_9"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "filters": 256, "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res2c_branch2c", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "res2c_branch2c"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn2c_branch2c", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]], "name": "bn2c_branch2c"}, {"class_name": "Add", "config": {"trainable": false, "dtype": "float32", "name": "add_3"}, "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_7", 0, 0, {}]]], "name": "add_3"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_10", "activation": "relu"}, "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "activation_10"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "filters": 128, "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res3a_branch2a", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [2, 2], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "res3a_branch2a"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn3a_branch2a", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]], "name": "bn3a_branch2a"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_11", "activation": "relu"}, "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]], "name": "activation_11"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "filters": 128, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res3a_branch2b", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "res3a_branch2b"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn3a_branch2b", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]], "name": "bn3a_branch2b"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_12", "activation": "relu"}, "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]], "name": "activation_12"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "filters": 512, "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res3a_branch2c", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "res3a_branch2c"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "filters": 512, "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res3a_branch1", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [2, 2], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "res3a_branch1"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn3a_branch2c", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]], "name": "bn3a_branch2c"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn3a_branch1", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]], "name": "bn3a_branch1"}, {"class_name": "Add", "config": {"trainable": false, "dtype": "float32", "name": "add_4"}, "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]], "name": "add_4"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_13", "activation": "relu"}, "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "activation_13"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "filters": 128, "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res3b_branch2a", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "res3b_branch2a"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn3b_branch2a", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]], "name": "bn3b_branch2a"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_14", "activation": "relu"}, "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]], "name": "activation_14"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "filters": 128, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res3b_branch2b", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "res3b_branch2b"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn3b_branch2b", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]], "name": "bn3b_branch2b"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_15", "activation": "relu"}, "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]], "name": "activation_15"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "filters": 512, "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res3b_branch2c", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "res3b_branch2c"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn3b_branch2c", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]], "name": "bn3b_branch2c"}, {"class_name": "Add", "config": {"trainable": false, "dtype": "float32", "name": "add_5"}, "inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_13", 0, 0, {}]]], "name": "add_5"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_16", "activation": "relu"}, "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "activation_16"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "filters": 128, "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res3c_branch2a", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "res3c_branch2a"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn3c_branch2a", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]], "name": "bn3c_branch2a"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_17", "activation": "relu"}, "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]], "name": "activation_17"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "filters": 128, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res3c_branch2b", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "res3c_branch2b"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn3c_branch2b", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]], "name": "bn3c_branch2b"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_18", "activation": "relu"}, "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]], "name": "activation_18"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "filters": 512, "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res3c_branch2c", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_18", 0, 0, {}]]], "name": "res3c_branch2c"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn3c_branch2c", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]], "name": "bn3c_branch2c"}, {"class_name": "Add", "config": {"trainable": false, "dtype": "float32", "name": "add_6"}, "inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_16", 0, 0, {}]]], "name": "add_6"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_19", "activation": "relu"}, "inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "activation_19"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "filters": 128, "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res3d_branch2a", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_19", 0, 0, {}]]], "name": "res3d_branch2a"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn3d_branch2a", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]], "name": "bn3d_branch2a"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_20", "activation": "relu"}, "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]], "name": "activation_20"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "filters": 128, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res3d_branch2b", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_20", 0, 0, {}]]], "name": "res3d_branch2b"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn3d_branch2b", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]], "name": "bn3d_branch2b"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_21", "activation": "relu"}, "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]], "name": "activation_21"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "filters": 512, "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res3d_branch2c", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "res3d_branch2c"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn3d_branch2c", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]], "name": "bn3d_branch2c"}, {"class_name": "Add", "config": {"trainable": false, "dtype": "float32", "name": "add_7"}, "inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_19", 0, 0, {}]]], "name": "add_7"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_22", "activation": "relu"}, "inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "activation_22"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "filters": 256, "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res4a_branch2a", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [2, 2], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "res4a_branch2a"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn4a_branch2a", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]], "name": "bn4a_branch2a"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_23", "activation": "relu"}, "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]], "name": "activation_23"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "filters": 256, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res4a_branch2b", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "res4a_branch2b"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn4a_branch2b", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]], "name": "bn4a_branch2b"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_24", "activation": "relu"}, "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]], "name": "activation_24"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "filters": 1024, "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res4a_branch2c", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_24", 0, 0, {}]]], "name": "res4a_branch2c"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "filters": 1024, "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res4a_branch1", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [2, 2], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "res4a_branch1"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn4a_branch2c", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]], "name": "bn4a_branch2c"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn4a_branch1", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]], "name": "bn4a_branch1"}, {"class_name": "Add", "config": {"trainable": false, "dtype": "float32", "name": "add_8"}, "inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]], "name": "add_8"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_25", "activation": "relu"}, "inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "activation_25"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "filters": 256, "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res4b_branch2a", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_25", 0, 0, {}]]], "name": "res4b_branch2a"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn4b_branch2a", "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]], "name": "bn4b_branch2a"}, {"class_name": "Activation", "config": {"trainable": false, "dtype": "float32", "name": "activation_26", "activation": "relu"}, "inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]], "name": "activation_26"}, {"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "filters": 256, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "res4b_branch2b", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["activation_26", 0, 0, {}]]], "name": "res4b_branch2b"}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [3], "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "beta_constraint": null, "name": "bn4b_branch2b", 