{"config": {"layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 224, 224, 3]}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "filters": 64, "name": "block1_conv1", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu"}, "name": "block1_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "filters": 64, "name": "block1_conv2", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu"}, "name": "block1_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"dtype": "float32", "data_format": "channels_last", "padding": "valid", "trainable": false, "name": "block1_pool", "pool_size": [2, 2], "strides": [2, 2]}, "name": "block1_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "filters": 128, "name": "block2_conv1", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu"}, "name": "block2_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "filters": 128, "name": "block2_conv2", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu"}, "name": "block2_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"dtype": "float32", "data_format": "channels_last", "padding": "valid", "trainable": false, "name": "block2_pool", "pool_size": [2, 2], "strides": [2, 2]}, "name": "block2_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "filters": 256, "name": "block3_conv1", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu"}, "name": "block3_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "filters": 256, "name": "block3_conv2", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu"}, "name": "block3_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "filters": 256, "name": "block3_conv3", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu"}, "name": "block3_conv3", "class_name": "Conv2D"}, {"inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "filters": 256, "name": "block3_conv4", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu"}, "name": "block3_conv4", "class_name": "Conv2D"}, {"inbound_nodes": [[["block3_conv4", 0, 0, {}]]], "config": {"dtype": "float32", "data_format": "channels_last", "padding": "valid", "trainable": false, "name": "block3_pool", "pool_size": [2, 2], "strides": [2, 2]}, "name": "block3_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "filters": 512, "name": "block4_conv1", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu"}, "name": "block4_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "filters": 512, "name": "block4_conv2", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu"}, "name": "block4_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "filters": 512, "name": "block4_conv3", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu"}, "name": "block4_conv3", "class_name": "Conv2D"}, {"inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "filters": 512, "name": "block4_conv4", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu"}, "name": "block4_conv4", "class_name": "Conv2D"}, {"inbound_nodes": [[["block4_conv4", 0, 0, {}]]], "config": {"dtype": "float32", "data_format": "channels_last", "padding": "valid", "trainable": false, "name": "block4_pool", "pool_size": [2, 2], "strides": [2, 2]}, "name": "block4_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "filters": 512, "name": "block5_conv1", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu"}, "name": "block5_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "filters": 512, "name": "block5_conv2", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu"}, "name": "block5_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "filters": 512, "name": "block5_conv3", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu"}, "name": "block5_conv3", "class_name": "Conv2D"}, {"inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "filters": 512, "name": "block5_conv4", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu"}, "name": "block5_conv4", "class_name": "Conv2D"}, {"inbound_nodes": [[["block5_conv4", 0, 0, {}]]], "config": {"dtype": "float32", "data_format": "channels_last", "padding": "valid", "trainable": false, "name": "block5_pool", "pool_size": [2, 2], "strides": [2, 2]}, "name": "block5_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block5_pool", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "flatten_3"}, "name": "flatten_3", "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_3", 0, 0, {}]]], "config": {"units": 4096, "dtype": "float32", "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "name": "dense_10", "bias_regularizer": null}, "name": "dense_10", "class_name": "Dense"}, {"inbound_nodes": [[["dense_10", 0, 0, {}]]], "config": {"seed": null, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "dropout_5", "rate": 0.5}, "name": "dropout_5", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_5", 0, 0, {}]]], "config": {"units": 4096, "dtype": "float32", "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "name": "dense_11", "bias_regularizer": null}, "name": "dense_11", "class_name": "Dense"}, {"inbound_nodes": [[["dense_11", 0, 0, {}]]], "config": {"seed": null, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "dropout_6", "rate": 0.5}, "name": "dropout_6", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_6", 0, 0, {}]]], "config": {"units": 3, "dtype": "float32", "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "name": "real", "bias_regularizer": null}, "name": "real", "class_name": "Dense"}, {"inbound_nodes": [[["dropout_6", 0, 0, {}]]], "config": {"units": 4, "dtype": "float32", "activation": "softmax", "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "name": "build", "bias_regularizer": null}, "name": "build", "class_name": "Dense"}, {"inbound_nodes": [[["dropout_6", 0, 0, {}]]], "config": {"units": 6, "dtype": "float32", "activation": "softmax", "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "name": "eye", "bias_regularizer": null}, "name": "eye", "class_name": "Dense"}, {"inbound_nodes": [[["dropout_6", 0, 0, {}]]], "config": {"units": 6, "dtype": "float32", "activation": "softmax", "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "name": "hair", "bias_regularizer": null}, "name": "hair", "class_name": "Dense"}, {"inbound_nodes": [[["dropout_6", 0, 0, {}]]], "config": {"units": 5, "dtype": "float32", "activation": "softmax", "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "name": "race", "bias_regularizer": null}, "name": "race", "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]], "name": "model_3", "output_layers": [["real", 0, 0], ["build", 0, 0], ["eye", 0, 0], ["hair", 0, 0], ["race", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.1.5-tf"}