{"backend": "tensorflow", "keras_version": "2.1.5-tf", "class_name": "Model", "config": {"name": "model_5", "input_layers": [["input_13", 0, 0], ["input_15", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_13", "config": {"batch_input_shape": [null, 224, 224, 3], "sparse": false, "name": "input_13", "dtype": "float32"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "input_15", "config": {"batch_input_shape": [null, 224, 224, 3], "sparse": false, "name": "input_15", "dtype": "float32"}}, {"inbound_nodes": [[["input_13", 0, 0, {}]]], "class_name": "Conv2D", "name": "block1_conv1", "config": {"activation": "relu", "filters": 64, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block1_conv1", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["input_15", 0, 0, {}]]], "class_name": "Conv2D", "name": "block1_conv1_2", "config": {"activation": "relu", "filters": 64, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block1_conv1_2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block1_conv2", "config": {"activation": "relu", "filters": 64, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block1_conv2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block1_conv1_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block1_conv2_2", "config": {"activation": "relu", "filters": 64, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block1_conv2_2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block1_pool", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": false, "name": "block1_pool", "dtype": "float32"}}, {"inbound_nodes": [[["block1_conv2_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block1_pool_2", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": false, "name": "block1_pool_2", "dtype": "float32"}}, {"inbound_nodes": [[["block1_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "block2_conv1", "config": {"activation": "relu", "filters": 128, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block2_conv1", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block1_pool_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block2_conv1_2", "config": {"activation": "relu", "filters": 128, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block2_conv1_2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block2_conv2", "config": {"activation": "relu", "filters": 128, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block2_conv2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block2_conv1_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block2_conv2_2", "config": {"activation": "relu", "filters": 128, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block2_conv2_2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block2_pool", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": false, "name": "block2_pool", "dtype": "float32"}}, {"inbound_nodes": [[["block2_conv2_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block2_pool_2", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": false, "name": "block2_pool_2", "dtype": "float32"}}, {"inbound_nodes": [[["block2_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv1", "config": {"activation": "relu", "filters": 256, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block3_conv1", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block2_pool_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv1_2", "config": {"activation": "relu", "filters": 256, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block3_conv1_2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv2", "config": {"activation": "relu", "filters": 256, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block3_conv2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block3_conv1_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv2_2", "config": {"activation": "relu", "filters": 256, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block3_conv2_2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv3", "config": {"activation": "relu", "filters": 256, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block3_conv3", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block3_conv2_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv3_2", "config": {"activation": "relu", "filters": 256, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block3_conv3_2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv4", "config": {"activation": "relu", "filters": 256, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block3_conv4", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block3_conv3_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv4_2", "config": {"activation": "relu", "filters": 256, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block3_conv4_2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block3_conv4", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block3_pool", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": false, "name": "block3_pool", "dtype": "float32"}}, {"inbound_nodes": [[["block3_conv4_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block3_pool_2", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": false, "name": "block3_pool_2", "dtype": "float32"}}, {"inbound_nodes": [[["block3_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv1", "config": {"activation": "relu", "filters": 512, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block4_conv1", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block3_pool_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv1_2", "config": {"activation": "relu", "filters": 512, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block4_conv1_2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv2", "config": {"activation": "relu", "filters": 512, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block4_conv2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block4_conv1_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv2_2", "config": {"activation": "relu", "filters": 512, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block4_conv2_2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv3", "config": {"activation": "relu", "filters": 512, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block4_conv3", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block4_conv2_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv3_2", "config": {"activation": "relu", "filters": 512, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block4_conv3_2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv4", "config": {"activation": "relu", "filters": 512, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block4_conv4", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block4_conv3_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv4_2", "config": {"activation": "relu", "filters": 512, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block4_conv4_2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block4_conv4", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block4_pool", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": false, "name": "block4_pool", "dtype": "float32"}}, {"inbound_nodes": [[["block4_conv4_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block4_pool_2", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": false, "name": "block4_pool_2", "dtype": "float32"}}, {"inbound_nodes": [[["block4_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv1", "config": {"activation": "relu", "filters": 512, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block5_conv1", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block4_pool_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv1_2", "config": {"activation": "relu", "filters": 512, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block5_conv1_2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv2", "config": {"activation": "relu", "filters": 512, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block5_conv2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block5_conv1_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv2_2", "config": {"activation": "relu", "filters": 512, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block5_conv2_2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv3", "config": {"activation": "relu", "filters": 512, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block5_conv3", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block5_conv2_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv3_2", "config": {"activation": "relu", "filters": 512, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block5_conv3_2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv4", "config": {"activation": "relu", "filters": 512, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block5_conv4", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block5_conv3_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv4_2", "config": {"activation": "relu", "filters": 512, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "trainable": false, "name": "block5_conv4_2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block5_conv4", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block5_pool", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": false, "name": "block5_pool", "dtype": "float32"}}, {"inbound_nodes": [[["block5_conv4_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block5_pool_2", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": false, "name": "block5_pool_2", "dtype": "float32"}}, {"inbound_nodes": [[["block5_pool", 0, 0, {}], ["block5_pool_2", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_8", "config": {"dtype": "float32", "axis": -1, "name": "concatenate_8", "trainable": true}}, {"inbound_nodes": [[["concatenate_8", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_4", "config": {"trainable": true, "name": "flatten_4", "dtype": "float32"}}, {"inbound_nodes": [[["flatten_4", 0, 0, {}]]], "class_name": "Dense", "name": "dense_14", "config": {"activation": "relu", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "dense_14", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null, "units": 4096, "use_bias": true, "dtype": "float32"}}, {"inbound_nodes": [[["dense_14", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_7", "config": {"rate": 0.5, "noise_shape": null, "seed": null, "trainable": true, "name": "dropout_7", "dtype": "float32"}}, {"inbound_nodes": [[["dropout_7", 0, 0, {}]]], "class_name": "Dense", "name": "dense_15", "config": {"activation": "relu", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "dense_15", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null, "units": 4096, "use_bias": true, "dtype": "float32"}}, {"inbound_nodes": [[["dense_15", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_8", "config": {"rate": 0.5, "noise_shape": null, "seed": null, "trainable": true, "name": "dropout_8", "dtype": "float32"}}, {"inbound_nodes": [[["dropout_8", 0, 0, {}]]], "class_name": "Dense", "name": "real", "config": {"activation": "sigmoid", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "real", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null, "units": 3, "use_bias": true, "dtype": "float32"}}, {"inbound_nodes": [[["dropout_8", 0, 0, {}]]], "class_name": "Dense", "name": "build", "config": {"activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "build", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null, "units": 4, "use_bias": true, "dtype": "float32"}}, {"inbound_nodes": [[["dropout_8", 0, 0, {}]]], "class_name": "Dense", "name": "eye", "config": {"activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "eye", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null, "units": 6, "use_bias": true, "dtype": "float32"}}, {"inbound_nodes": [[["dropout_8", 0, 0, {}]]], "class_name": "Dense", "name": "hair", "config": {"activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "hair", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null, "units": 6, "use_bias": true, "dtype": "float32"}}, {"inbound_nodes": [[["dropout_8", 0, 0, {}]]], "class_name": "Dense", "name": "race", "config": {"activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "race", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null, "units": 5, "use_bias": true, "dtype": "float32"}}], "output_layers": [["real", 0, 0], ["build", 0, 0], ["eye", 0, 0], ["hair", 0, 0], ["race", 0, 0]]}}