{"backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "sparse": false, "name": "input_1", "dtype": "float32"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"activation": "relu", "padding": "same", "kernel_size": [3, 3], "name": "block1_conv1", "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "filters": 64, "dilation_rate": [1, 1], "trainable": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null}, "name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "padding": "same", "kernel_size": [3, 3], "name": "block1_conv2", "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "filters": 64, "dilation_rate": [1, 1], "trainable": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null}, "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "name": "block1_pool", "trainable": false, "dtype": "float32", "padding": "valid"}, "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "padding": "same", "kernel_size": [3, 3], "name": "block2_conv1", "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "filters": 128, "dilation_rate": [1, 1], "trainable": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null}, "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "padding": "same", "kernel_size": [3, 3], "name": "block2_conv2", "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "filters": 128, "dilation_rate": [1, 1], "trainable": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null}, "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "name": "block2_pool", "trainable": false, "dtype": "float32", "padding": "valid"}, "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "padding": "same", "kernel_size": [3, 3], "name": "block3_conv1", "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "filters": 256, "dilation_rate": [1, 1], "trainable": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null}, "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "padding": "same", "kernel_size": [3, 3], "name": "block3_conv2", "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "filters": 256, "dilation_rate": [1, 1], "trainable": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null}, "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "padding": "same", "kernel_size": [3, 3], "name": "block3_conv3", "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "filters": 256, "dilation_rate": [1, 1], "trainable": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null}, "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "padding": "same", "kernel_size": [3, 3], "name": "block3_conv4", "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "filters": 256, "dilation_rate": [1, 1], "trainable": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null}, "name": "block3_conv4", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "name": "block3_pool", "trainable": false, "dtype": "float32", "padding": "valid"}, "name": "block3_pool", "inbound_nodes": [[["block3_conv4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "padding": "same", "kernel_size": [3, 3], "name": "block4_conv1", "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "filters": 512, "dilation_rate": [1, 1], "trainable": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null}, "name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "padding": "same", "kernel_size": [3, 3], "name": "block4_conv2", "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "filters": 512, "dilation_rate": [1, 1], "trainable": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null}, "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "padding": "same", "kernel_size": [3, 3], "name": "block4_conv3", "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "filters": 512, "dilation_rate": [1, 1], "trainable": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null}, "name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "padding": "same", "kernel_size": [3, 3], "name": "block4_conv4", "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "filters": 512, "dilation_rate": [1, 1], "trainable": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null}, "name": "block4_conv4", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "name": "block4_pool", "trainable": false, "dtype": "float32", "padding": "valid"}, "name": "block4_pool", "inbound_nodes": [[["block4_conv4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "padding": "same", "kernel_size": [3, 3], "name": "block5_conv1", "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "filters": 512, "dilation_rate": [1, 1], "trainable": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null}, "name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "padding": "same", "kernel_size": [3, 3], "name": "block5_conv2", "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "filters": 512, "dilation_rate": [1, 1], "trainable": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null}, "name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "padding": "same", "kernel_size": [3, 3], "name": "block5_conv3", "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "filters": 512, "dilation_rate": [1, 1], "trainable": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null}, "name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "padding": "same", "kernel_size": [3, 3], "name": "block5_conv4", "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "filters": 512, "dilation_rate": [1, 1], "trainable": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null}, "name": "block5_conv4", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "name": "block5_pool", "trainable": false, "dtype": "float32", "padding": "valid"}, "name": "block5_pool", "inbound_nodes": [[["block5_conv4", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32"}, "name": "flatten_1", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"activation": "relu", "name": "dense_1", "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "units": 4096, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null}, "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "trainable": true, "dtype": "float32", "seed": null, "rate": 0.5}, "name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"activation": "relu", "name": "dense_2", "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "units": 4096, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "trainable": true, "dtype": "float32", "seed": null, "rate": 0.5}, "name": "dropout_2", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"activation": "sigmoid", "name": "dense_3", "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "units": 3, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null}, "name": "dense_3", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"activation": "sigmoid", "name": "dense_4", "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "units": 25, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null}, "name": "dense_4", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_3", 0, 0], ["dense_4", 0, 0]], "name": "model_1"}, "keras_version": "2.1.5-tf"}